---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.IlluminationFailures.LightingFixtureLumensWarning
source: html/d377a5c9-cd7a-bd96-c724-f9d070306acd.htm
---
# Autodesk.Revit.DB.BuiltInFailures.IlluminationFailures.LightingFixtureLumensWarning Property

Estimated Illumination failed. Lumens not set for lighting fixture.

## Syntax (C#)
```csharp
public static FailureDefinitionId LightingFixtureLumensWarning { get; }
```